tap "oven-sh/bun"
tap "sdkman/tap"
tap "theboredteam/boring-notch"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line fuzzy finder written in Go
brew "fzf"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Language Server for the Lua language
brew "lua-language-server"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line interface for SQLite
brew "sqlite"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Rust toolchain installer
brew "rustup"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# SDKMAN! the Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
# Chromium based browser
cask "arc"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# All-in-one toolbox for developers
cask "devutils"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Discover, download, and run local LLMs
cask "lm-studio"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# GUI for streamlined Redis application development
cask "redis-insight"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "sabrsorensen.synthwave-blues"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
